mikaelpatel/Cosa-Anarduino/boards.txt
# @file boards.txt
# @version 1.0
#
# @section License
# Copyright (C) 2014-2015, Mikael Patel
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.
#
# @section Description
# The Cosa Anarduino boards definition file.
#
# This file is part of the Arduino Che Cosa project.

##
# ANARDUINO BOARDS
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00).
miniwireless.name=Cosa Anarduino MiniWireless (ATmega328/BOOT_168)
miniwireless.upload.tool=avrdude
miniwireless.upload.protocol=arduino
miniwireless.upload.maximum_size=30720
miniwireless.upload.maximum_data_size=2048
miniwireless.upload.maximum_eeprom_size=1024
miniwireless.upload.speed=57600

miniwireless.bootloader.tool=avrdude
miniwireless.bootloader.low_fuses=0xff
miniwireless.bootloader.high_fuses=0xda
miniwireless.bootloader.extended_fuses=0x05

miniwireless.build.mcu=atmega328p
miniwireless.build.f_cpu=16000000L
miniwireless.build.board=ANARDUINO_MINIWIRELESS
miniwireless.build.variant=anarduino/miniwireless
miniwireless.build.core=Cosa:cosa

